EDT/УТ/src/Documents/ЗагрузкаСТСД/ЗагрузкаСТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗагрузкаСТСД</name>
  <registerRecords>InformationRegister.ФиксацияВеса</registerRecords>
  <registerRecords>InformationRegister.ФиксацияОбъема</registerRecords>
  <registerRecords>InformationRegister.экУчетПроизводственныхОпераций</registerRecords>
  <registerRecords>InformationRegister.УчетВыходаНаРаботуСотрудниковКомпании</registerRecords>
  <registerRecords>InformationRegister.СтатусыСкладскогоУчета</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗагрузкиТСД</name>
    <type>
      <types>EnumRef.ТипыЗагрузкиТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>Ид_Документа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ид_Терминала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверТСД</name>
    <type>
      <types>CatalogRef.СерверыWiFiТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыВыгруженыВАдминку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныеВесы</name>
    <type>
      <types>CatalogRef.ЭлектронныеВесы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчитыватьВес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПриходПринципала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИзмеренияГабаритов</name>
    <type>
      <types>CatalogRef.ЛинейкиИзмеренияГабаритов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВспомогательныйРежимТСД</name>
    <type>
      <types>EnumRef.ТипыЗагрузкиТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПалеты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Штрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.Фрахт</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатДоставки</name>
      <type>
        <types>CatalogRef.новаРезультатМестнойДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевыполнения</name>
      <type>
        <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакСтабильностиВесов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НеизвестныйТовар</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СканированныйОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>22</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоЗаказа</name>
      <type>
        <types>CatalogRef.МестаПоЗаказам</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсключитьЧастичноПринятыйЗаказИзРейса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИзмерениеГабаритов</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодГабарита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Измерение</name>
      <type>
        <types>EnumRef.Измерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеИзмерения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаИзмерения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БэйджиСотрудников</name>
    <attributes>
      <name>БейджСотрудника</name>
      <type>
        <types>CatalogRef.БэйджиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчастникаЭкипажа</name>
      <type>
        <types>EnumRef.УчастникЭкипажа</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СервисныеШК</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Режим</name>
      <type>
        <types>EnumRef.ТипыЗагрузкиТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыРейса</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИгнорируемыеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПараметрыРегламентныхЗаданий/ПараметрыРегламентныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыРегламентныхЗаданий</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыЗагрузкиТСД/ТипыЗагрузкиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗагрузкиТСД</name>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>КорректировкиВозвратов</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFi</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiПоСекторам</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаТранспортаWiFiПоСекторам</name>
  </enumValues>
  <enumValues>
    <name>ВозвратWiFiПоКонтрагентам</name>
  </enumValues>
  <enumValues>
    <name>НаборнаяВедомостьВозвраты</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiVeeRoute</name>
  </enumValues>
  <enumValues>
    <name>ПриходOZONE</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiVeeRouteСВесом</name>
  </enumValues>
  <enumValues>
    <name>Аксиомус</name>
  </enumValues>
  <enumValues>
    <name>ПриходWiFiVeeRouteСВыборкойНазад</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаЗаказовНаРегиональномТерминале</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаВАвто</name>
  </enumValues>
  <enumValues>
    <name>ПриездАвтоКомитента</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаВАвтоФактическая</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаВАвтоНезагруженныеЗаказы</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/ЗагрузкаСТСД/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ВнешнийНомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ВнешнийНомерЗаказа) Тогда
		Зап = Новый Запрос;
		//+Степанов Задача № 3787 В поиск включена ТЧ игнорируемых ШК
		//Зап.Текст = "ВЫБРАТЬ
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер
		//            |ИЗ
		//            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		//            |ГДЕ
		//            |	(ЗагрузкаСТСДШтрихкоды.Заказ.НомерВнешнегоЗаказа = &НомерВнешнегоЗаказа
		//            |			ИЛИ ЗагрузкаСТСДШтрихкоды.Штрихкод = &НомерВнешнегоЗаказа
		//            |			ИЛИ ЗагрузкаСТСДШтрихкоды.ВнешнийНомерЗаказа = &НомерВнешнегоЗаказа)
		//            |
		//            |СГРУППИРОВАТЬ ПО
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер";
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК Ссылка
		            |ПОМЕСТИТЬ втНайденныеДокументы
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.Заказ.НомерВнешнегоЗаказа = &НомерВнешнегоЗаказа
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.Штрихкод = &НомерВнешнегоЗаказа
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.ВнешнийНомерЗаказа = &НомерВнешнегоЗаказа
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.ИгнорируемыеШтрихкоды КАК ЗагрузкаСТСДИгнорируемыеШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Штрихкод = &НомерВнешнегоЗаказа
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	втНайденныеДокументы.Номер КАК Номер
		            |ИЗ
		            |	втНайденныеДокументы КАК втНайденныеДокументы
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	втНайденныеДокументы.Номер,
		            |	втНайденныеДокументы.Ссылка";
		//-Степанов Задача № 3787 
		Зап.УстановитьПараметр("НомерВнешнегоЗаказа", ВнешнийНомерЗаказа);
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоиск(Команда)
	// Вставить содержимое обработчика.
		ИП = "Номер";
		ПЗ = Новый Массив;
		Исп = Ложь;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
								
		ИП = "ТипЗагрузкиТСД";
		ПЗ = 1;
		Исп = Ложь;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
								
	//Список.Отбор.элементы[2].Использование = Ложь;
	ВнешнийНомерЗаказа = "";
	НомерЗаказа = "";
	Штрихкод = "";
КонецПроцедуры


&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	(ЗагрузкаСТСДШтрихкоды.Заказ.Номер = &НомерЗаказа
		            |			ИЛИ ЗагрузкаСТСДШтрихкоды.ВнешнийНомерЗаказа = &НомерЗаказа)
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер";
		Зап.УстановитьПараметр("НомерЗаказа", Формат(НомерЗаказа, "ЧГ="));
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры


&НаКлиенте
Процедура ТипЗагрузкиПриИзменении(Элемент)
	Если ТипЗагрузки.Пустая() Тогда
		ИП = "ТипЗагрузкиТСД";
		ПЗ = 1;
		Исп = Ложь;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	Иначе	
		ИП = "ТипЗагрузкиТСД";
		ПЗ = ТипЗагрузки;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	КонецЕСли;	
	
	ТекущийЭлемент = Элементы.Список;
	Shell = Новый COMОбъект("WScript.Shell");
	Shell.SendKeys("^{END}");	
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипЗагрузки = Перечисления.ТипыЗагрузкиТСД.ПриходWiFiVeeRoute;
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	//+++ БАО 22.08.2017 №1730
	//bao.ДобавитьОтборДинСпискаПоДоступнымПользователюТерминалам(Список, "ТерминалПриема");
	//--- БАО 22.08.2017 №1730
	ПериодОтбораАктивныхТСД = Новый СтандартныйПериод(НачалоДня(ТекущаяДата()), КонецДня(ТекущаяДата()));
	КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ТипЗагрузкиПриИзменении(Неопределено);
	bao.ДобавитьОтборДинСпискаПоДоступнымПользователюТерминалам(Список, "ТерминалПриема");
	ПериодОтбораАктивныхТСДПриИзменении(Неопределено);
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузкаДанныхWiFi(Команда)
	От = Вопрос("Удалить после загрузки документы с сервера ТСД?", РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	
	Если От = КодВозвратаДиалога.Да Тогда
		lem.РегламентЗагрузкаДанныхСТСД(Истина);
	Иначе	
		lem.РегламентЗагрузкаДанныхСТСД(Ложь);
	КонецеСли;
	
	ОбновитьОтображениеДанных();
	ТекущийЭлемент = Элементы.Список;
	Shell = Новый COMОбъект("WScript.Shell");
	Shell.SendKeys("^{END}");	
КонецПроцедуры


&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		Зап = Новый Запрос;
		//+Степанов Задача № 3787 В поиск включена ТЧ игнорируемых ШК
		//Зап.Текст = "ВЫБРАТЬ
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер
		//            |ИЗ
		//            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		//            |ГДЕ
		//            |	ЗагрузкаСТСДШтрихкоды.Штрихкод ПОДОБНО &Штрихкод
		//            |
		//            |СГРУППИРОВАТЬ ПО
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		//            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер";
		Зап.Текст = "ВЫБРАТЬ
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер КАК Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка КАК Ссылка
		            |ПОМЕСТИТЬ втНайденныеДокументы
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДШтрихкоды.Штрихкод ПОДОБНО &Штрихкод
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Ссылка,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДШтрихкоды.Ссылка
		            |
		            |ОБЪЕДИНИТЬ ВСЕ
		            |
		            |ВЫБРАТЬ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка.Номер,
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Ссылка
		            |ИЗ
		            |	Документ.ЗагрузкаСТСД.ИгнорируемыеШтрихкоды КАК ЗагрузкаСТСДИгнорируемыеШтрихкоды
		            |ГДЕ
		            |	ЗагрузкаСТСДИгнорируемыеШтрихкоды.Штрихкод ПОДОБНО &Штрихкод
		            |;
		            |
		            |////////////////////////////////////////////////////////////////////////////////
		            |ВЫБРАТЬ
		            |	втНайденныеДокументы.Номер КАК Номер
		            |ИЗ
		            |	втНайденныеДокументы КАК втНайденныеДокументы
		            |
		            |СГРУППИРОВАТЬ ПО
		            |	втНайденныеДокументы.Ссылка,
		            |	втНайденныеДокументы.Номер";
		//+Степанов Задача № 3787
		Зап.УстановитьПараметр("Штрихкод", "%" + СокрЛП(Штрихкод) + "%");
		
		Рез = Зап.Выполнить().Выбрать();;
		Мас = Новый Массив;
		Если Рез.Количество() = 0 Тогда
			ОчиститьПоиск(Неопределено);
		Иначе
			Пока Рез.Следующий() Цикл
				Мас.Добавить(Рез.Номер);
			КонецЦикла;	
		ИП = "Номер";
		ПЗ = Мас;
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
		КонецеСли;	
	Иначе
		ОчиститьПоиск(Неопределено);
	КонецеСли;
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СнятьРежимЗагрузкиНаСервере()
	Константы.ФлагЗагрузкиДанныхСТСД.Установить(Ложь);	
КонецПроцедуры


&НаКлиенте
Процедура СнятьРежимЗагрузки(Команда)
	СнятьРежимЗагрузкиНаСервере();
КонецПроцедуры


&НаСервереБезКонтекста
Процедура СнятьРежимЗагрузки_v3НаСервере()
	Константы.ФлагЗагрузкиДанныхСТСД_V3.Установить(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура СнятьРежимЗагрузки_v3(Команда)
	//СнятьРежимЗагрузки_v3НаСервере();
	СписокСерверовОбменаСВзведеннымиФлагамиОбмена = ПолучитьСписокСерверовОбменаТСДСУстановленнымФлагом();
	Если СписокСерверовОбменаСВзведеннымиФлагамиОбмена = Неопределено Тогда
		Сообщить("Нет серверов обмена с взведенными флагами обмена!!!", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецеСли;
	
	ВыбранныйСервер = СписокСерверовОбменаСВзведеннымиФлагамиОбмена.ВыбратьЭлемент("Сервер обмена V3");
	Если ВыбранныйСервер <> Неопределено Тогда
		РаботаСТСДСервер.УстановитьФлагЗагрузкиСТСД(ВыбранныйСервер.Значение, Ложь);
	КонецеСли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокСерверовОбменаТСДСУстановленнымФлагом()
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ПараметрыРегламентныхЗаданий.Ключ КАК Наименование
	            |ИЗ
	            |	РегистрСведений.ПараметрыРегламентныхЗаданий КАК ПараметрыРегламентныхЗаданий
	            |ГДЕ
	            |	ПараметрыРегламентныхЗаданий.Ключ ПОДОБНО &Парам
	            |	И ПараметрыРегламентныхЗаданий.Значение = ""1""
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	Наименование";
	Зап.УстановитьПараметр("Парам", "ФлагЗагрузкиТСД__%");
	
	Сп = Новый СписокЗначений;
	Рез = Зап.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецеСли;
	
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		СобрНаим = СтрЗаменить(Выб.Наименование, "__", Символы.ПС);
		СО = Справочники.СерверыОбменаСТСД.НайтиПоКоду(СтрПолучитьСтроку(СобрНаим, 2));
		Сп.Добавить(СО.Ссылка, СО.Наименование);
	КонецЦикла;	
	
	Возврат Сп;
КонецФункции	


&НаКлиенте
Процедура ПериодОтбораАктивныхТСДПриИзменении(Элемент)
	СписокАктивныхТСД.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОтбораАктивныхТСД.ДатаНачала);
	СписокАктивныхТСД.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОтбораАктивныхТСД.ДатаОкончания);
	Элементы.СписокАктивныхТСД.Обновить();
	
	СписокТСДПоТерминалам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОтбораАктивныхТСД.ДатаНачала);
	СписокТСДПоТерминалам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОтбораАктивныхТСД.ДатаОкончания);
	Элементы.СписокТСДПоТерминалам.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСписокАктивныхТСД(Команда)
	// Вставить содержимое обработчика.
	Элементы.ФормаОткрытьСписокАктивныхТСД.Пометка = Не Элементы.ФормаОткрытьСписокАктивныхТСД.Пометка;
	Элементы.ГруппаСписокТСД.Видимость = Элементы.ФормаОткрытьСписокАктивныхТСД.Пометка;
КонецПроцедуры


&НаКлиенте
Процедура ТолькоНовыеТСДПриИзменении(Элемент)
	Если ТолькоНовыеТСД Тогда
		ИП = "СерверТСД";
		ПЗ = Справочники.СерверыWiFiТСД.СерверСканирования;
		//Справочники.СерверыWiFiТСД.ПустаяСсылка();
		Исп = Истина;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	Иначе	
		ИП = "СерверТСД";
		ПЗ = "";
		Исп = Ложь;
		//ВидСравненияП = ВидСравнения.НеРавно;
		ОбщегоНазначенияКлиентСервер83.УстановитьЭлементОтбора(Список.Отбор,
								ИП,
								ПЗ,
								,
								,
								Исп,
								,
								);
	КонецЕСли;	
	
	ТекущийЭлемент = Элементы.Список;
	Shell = Новый COMОбъект("WScript.Shell");
	Shell.SendKeys("^{END}");	
КонецПроцедуры
